Revit 2027 API
RebarShapeDefinitionByArc(Document, Double, Double, Int32, Int32) Constructor
 Create a spiral shape definition.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarShapeDefinitionByArc(
	Document doc,
	double height,
	double pitch,
	int baseFinishingTurns,
	int topFinishingTurns
)
Public Sub New (
	doc As Document,
	height As Double,
	pitch As Double,
	baseFinishingTurns As Integer,
	topFinishingTurns As Integer
)
public:
RebarShapeDefinitionByArc(
	Document^ doc,
	double height,
	double pitch,
	int baseFinishingTurns,
	int topFinishingTurns
)
new :
        doc : Document *
        height : float *
        pitch : float *
        baseFinishingTurns : int *
        topFinishingTurns : int -> RebarShapeDefinitionByArc
Parameters
doc Document
height Double
 The height of the spiral (assuming the spiral is vertical).
pitch Double
 The pitch, or vertical distance traveled in one rotation.
baseFinishingTurns Int32
 The number of finishing turns at the lower end of the spiral.
topFinishingTurns Int32
 The number of finishing turns at the upper end of the spiral.
Exceptions
Exception | Condition
ArgumentException |  baseFinishingTurns is not between 0 and 100. -or- topFinishingTurns is not between 0 and 100.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  The given value for height must be greater than 0 and no more than 30000 feet. -or- The given value for pitch must be greater than 0 and no more than 30000 feet.
Remarks
 In order to create a spiral definition, you must provide default values for the spiral-specific parameters. Replaces RebarShape.NewDefinitionByArc() from prior versions.
See Also
Reference
RebarShapeDefinitionByArc Class
RebarShapeDefinitionByArc Overload
Autodesk.Revit.DB.Structure Namespace